###################################################################

# Created by write_sdc on Mon Mar 13 20:49:58 2017

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -power mW -voltage V       \
-current mA
set_max_area 3.0e+06
set_driving_cell -lib_cell inv_1 [get_ports {op[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {op[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {op[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {op[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {in1[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {in2[0]}]
set_load -pin_load 57.462 [get_ports {out[31]}]
set_load -pin_load 57.462 [get_ports {out[30]}]
set_load -pin_load 57.462 [get_ports {out[29]}]
set_load -pin_load 57.462 [get_ports {out[28]}]
set_load -pin_load 57.462 [get_ports {out[27]}]
set_load -pin_load 57.462 [get_ports {out[26]}]
set_load -pin_load 57.462 [get_ports {out[25]}]
set_load -pin_load 57.462 [get_ports {out[24]}]
set_load -pin_load 57.462 [get_ports {out[23]}]
set_load -pin_load 57.462 [get_ports {out[22]}]
set_load -pin_load 57.462 [get_ports {out[21]}]
set_load -pin_load 57.462 [get_ports {out[20]}]
set_load -pin_load 57.462 [get_ports {out[19]}]
set_load -pin_load 57.462 [get_ports {out[18]}]
set_load -pin_load 57.462 [get_ports {out[17]}]
set_load -pin_load 57.462 [get_ports {out[16]}]
set_load -pin_load 57.462 [get_ports {out[15]}]
set_load -pin_load 57.462 [get_ports {out[14]}]
set_load -pin_load 57.462 [get_ports {out[13]}]
set_load -pin_load 57.462 [get_ports {out[12]}]
set_load -pin_load 57.462 [get_ports {out[11]}]
set_load -pin_load 57.462 [get_ports {out[10]}]
set_load -pin_load 57.462 [get_ports {out[9]}]
set_load -pin_load 57.462 [get_ports {out[8]}]
set_load -pin_load 57.462 [get_ports {out[7]}]
set_load -pin_load 57.462 [get_ports {out[6]}]
set_load -pin_load 57.462 [get_ports {out[5]}]
set_load -pin_load 57.462 [get_ports {out[4]}]
set_load -pin_load 57.462 [get_ports {out[3]}]
set_load -pin_load 57.462 [get_ports {out[2]}]
set_load -pin_load 57.462 [get_ports {out[1]}]
set_load -pin_load 57.462 [get_ports {out[0]}]
