###################################################################

# Created by write_sdc on Wed Mar 22 10:13:45 2017

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -power mW -voltage V       \
-current mA
set_wire_load_model -name 10x10 -library vtvt_tsmc180
set_max_area 1.0e+06
set_driving_cell -lib_cell inv_1 [get_ports clk]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {ext_interrupts[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hrdata[0]}]
set_driving_cell -lib_cell inv_1 [get_ports imem_hready]
set_driving_cell -lib_cell inv_1 [get_ports {imem_hresp[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hrdata[0]}]
set_driving_cell -lib_cell inv_1 [get_ports dmem_hready]
set_driving_cell -lib_cell inv_1 [get_ports {dmem_hresp[0]}]
set_driving_cell -lib_cell inv_1 [get_ports htif_reset]
set_driving_cell -lib_cell inv_1 [get_ports htif_id]
set_driving_cell -lib_cell inv_1 [get_ports htif_pcr_req_valid]
set_driving_cell -lib_cell inv_1 [get_ports htif_pcr_req_rw]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_addr[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[63]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[62]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[61]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[60]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[59]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[58]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[57]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[56]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[55]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[54]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[53]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[52]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[51]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[50]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[49]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[48]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[47]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[46]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[45]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[44]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[43]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[42]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[41]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[40]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[39]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[38]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[37]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[36]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[35]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[34]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[33]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[32]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {htif_pcr_req_data[0]}]
set_driving_cell -lib_cell inv_1 [get_ports htif_pcr_resp_ready]
set_driving_cell -lib_cell inv_1 [get_ports htif_ipi_req_ready]
set_driving_cell -lib_cell inv_1 [get_ports htif_ipi_resp_valid]
set_driving_cell -lib_cell inv_1 [get_ports htif_ipi_resp_data]
set_load -pin_load 50 [get_ports {imem_haddr[31]}]
set_load -pin_load 50 [get_ports {imem_haddr[30]}]
set_load -pin_load 50 [get_ports {imem_haddr[29]}]
set_load -pin_load 50 [get_ports {imem_haddr[28]}]
set_load -pin_load 50 [get_ports {imem_haddr[27]}]
set_load -pin_load 50 [get_ports {imem_haddr[26]}]
set_load -pin_load 50 [get_ports {imem_haddr[25]}]
set_load -pin_load 50 [get_ports {imem_haddr[24]}]
set_load -pin_load 50 [get_ports {imem_haddr[23]}]
set_load -pin_load 50 [get_ports {imem_haddr[22]}]
set_load -pin_load 50 [get_ports {imem_haddr[21]}]
set_load -pin_load 50 [get_ports {imem_haddr[20]}]
set_load -pin_load 50 [get_ports {imem_haddr[19]}]
set_load -pin_load 50 [get_ports {imem_haddr[18]}]
set_load -pin_load 50 [get_ports {imem_haddr[17]}]
set_load -pin_load 50 [get_ports {imem_haddr[16]}]
set_load -pin_load 50 [get_ports {imem_haddr[15]}]
set_load -pin_load 50 [get_ports {imem_haddr[14]}]
set_load -pin_load 50 [get_ports {imem_haddr[13]}]
set_load -pin_load 50 [get_ports {imem_haddr[12]}]
set_load -pin_load 50 [get_ports {imem_haddr[11]}]
set_load -pin_load 50 [get_ports {imem_haddr[10]}]
set_load -pin_load 50 [get_ports {imem_haddr[9]}]
set_load -pin_load 50 [get_ports {imem_haddr[8]}]
set_load -pin_load 50 [get_ports {imem_haddr[7]}]
set_load -pin_load 50 [get_ports {imem_haddr[6]}]
set_load -pin_load 50 [get_ports {imem_haddr[5]}]
set_load -pin_load 50 [get_ports {imem_haddr[4]}]
set_load -pin_load 50 [get_ports {imem_haddr[3]}]
set_load -pin_load 50 [get_ports {imem_haddr[2]}]
set_load -pin_load 50 [get_ports {imem_haddr[1]}]
set_load -pin_load 50 [get_ports {imem_haddr[0]}]
set_load -pin_load 50 [get_ports imem_hwrite]
set_load -pin_load 50 [get_ports {imem_hsize[2]}]
set_load -pin_load 50 [get_ports {imem_hsize[1]}]
set_load -pin_load 50 [get_ports {imem_hsize[0]}]
set_load -pin_load 50 [get_ports {imem_hburst[2]}]
set_load -pin_load 50 [get_ports {imem_hburst[1]}]
set_load -pin_load 50 [get_ports {imem_hburst[0]}]
set_load -pin_load 50 [get_ports imem_hmastlock]
set_load -pin_load 50 [get_ports {imem_hprot[3]}]
set_load -pin_load 50 [get_ports {imem_hprot[2]}]
set_load -pin_load 50 [get_ports {imem_hprot[1]}]
set_load -pin_load 50 [get_ports {imem_hprot[0]}]
set_load -pin_load 50 [get_ports {imem_htrans[1]}]
set_load -pin_load 50 [get_ports {imem_htrans[0]}]
set_load -pin_load 50 [get_ports {imem_hwdata[31]}]
set_load -pin_load 50 [get_ports {imem_hwdata[30]}]
set_load -pin_load 50 [get_ports {imem_hwdata[29]}]
set_load -pin_load 50 [get_ports {imem_hwdata[28]}]
set_load -pin_load 50 [get_ports {imem_hwdata[27]}]
set_load -pin_load 50 [get_ports {imem_hwdata[26]}]
set_load -pin_load 50 [get_ports {imem_hwdata[25]}]
set_load -pin_load 50 [get_ports {imem_hwdata[24]}]
set_load -pin_load 50 [get_ports {imem_hwdata[23]}]
set_load -pin_load 50 [get_ports {imem_hwdata[22]}]
set_load -pin_load 50 [get_ports {imem_hwdata[21]}]
set_load -pin_load 50 [get_ports {imem_hwdata[20]}]
set_load -pin_load 50 [get_ports {imem_hwdata[19]}]
set_load -pin_load 50 [get_ports {imem_hwdata[18]}]
set_load -pin_load 50 [get_ports {imem_hwdata[17]}]
set_load -pin_load 50 [get_ports {imem_hwdata[16]}]
set_load -pin_load 50 [get_ports {imem_hwdata[15]}]
set_load -pin_load 50 [get_ports {imem_hwdata[14]}]
set_load -pin_load 50 [get_ports {imem_hwdata[13]}]
set_load -pin_load 50 [get_ports {imem_hwdata[12]}]
set_load -pin_load 50 [get_ports {imem_hwdata[11]}]
set_load -pin_load 50 [get_ports {imem_hwdata[10]}]
set_load -pin_load 50 [get_ports {imem_hwdata[9]}]
set_load -pin_load 50 [get_ports {imem_hwdata[8]}]
set_load -pin_load 50 [get_ports {imem_hwdata[7]}]
set_load -pin_load 50 [get_ports {imem_hwdata[6]}]
set_load -pin_load 50 [get_ports {imem_hwdata[5]}]
set_load -pin_load 50 [get_ports {imem_hwdata[4]}]
set_load -pin_load 50 [get_ports {imem_hwdata[3]}]
set_load -pin_load 50 [get_ports {imem_hwdata[2]}]
set_load -pin_load 50 [get_ports {imem_hwdata[1]}]
set_load -pin_load 50 [get_ports {imem_hwdata[0]}]
set_load -pin_load 50 [get_ports {dmem_haddr[31]}]
set_load -pin_load 50 [get_ports {dmem_haddr[30]}]
set_load -pin_load 50 [get_ports {dmem_haddr[29]}]
set_load -pin_load 50 [get_ports {dmem_haddr[28]}]
set_load -pin_load 50 [get_ports {dmem_haddr[27]}]
set_load -pin_load 50 [get_ports {dmem_haddr[26]}]
set_load -pin_load 50 [get_ports {dmem_haddr[25]}]
set_load -pin_load 50 [get_ports {dmem_haddr[24]}]
set_load -pin_load 50 [get_ports {dmem_haddr[23]}]
set_load -pin_load 50 [get_ports {dmem_haddr[22]}]
set_load -pin_load 50 [get_ports {dmem_haddr[21]}]
set_load -pin_load 50 [get_ports {dmem_haddr[20]}]
set_load -pin_load 50 [get_ports {dmem_haddr[19]}]
set_load -pin_load 50 [get_ports {dmem_haddr[18]}]
set_load -pin_load 50 [get_ports {dmem_haddr[17]}]
set_load -pin_load 50 [get_ports {dmem_haddr[16]}]
set_load -pin_load 50 [get_ports {dmem_haddr[15]}]
set_load -pin_load 50 [get_ports {dmem_haddr[14]}]
set_load -pin_load 50 [get_ports {dmem_haddr[13]}]
set_load -pin_load 50 [get_ports {dmem_haddr[12]}]
set_load -pin_load 50 [get_ports {dmem_haddr[11]}]
set_load -pin_load 50 [get_ports {dmem_haddr[10]}]
set_load -pin_load 50 [get_ports {dmem_haddr[9]}]
set_load -pin_load 50 [get_ports {dmem_haddr[8]}]
set_load -pin_load 50 [get_ports {dmem_haddr[7]}]
set_load -pin_load 50 [get_ports {dmem_haddr[6]}]
set_load -pin_load 50 [get_ports {dmem_haddr[5]}]
set_load -pin_load 50 [get_ports {dmem_haddr[4]}]
set_load -pin_load 50 [get_ports {dmem_haddr[3]}]
set_load -pin_load 50 [get_ports {dmem_haddr[2]}]
set_load -pin_load 50 [get_ports {dmem_haddr[1]}]
set_load -pin_load 50 [get_ports {dmem_haddr[0]}]
set_load -pin_load 50 [get_ports dmem_hwrite]
set_load -pin_load 50 [get_ports {dmem_hsize[2]}]
set_load -pin_load 50 [get_ports {dmem_hsize[1]}]
set_load -pin_load 50 [get_ports {dmem_hsize[0]}]
set_load -pin_load 50 [get_ports {dmem_hburst[2]}]
set_load -pin_load 50 [get_ports {dmem_hburst[1]}]
set_load -pin_load 50 [get_ports {dmem_hburst[0]}]
set_load -pin_load 50 [get_ports dmem_hmastlock]
set_load -pin_load 50 [get_ports {dmem_hprot[3]}]
set_load -pin_load 50 [get_ports {dmem_hprot[2]}]
set_load -pin_load 50 [get_ports {dmem_hprot[1]}]
set_load -pin_load 50 [get_ports {dmem_hprot[0]}]
set_load -pin_load 50 [get_ports {dmem_htrans[1]}]
set_load -pin_load 50 [get_ports {dmem_htrans[0]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[31]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[30]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[29]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[28]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[27]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[26]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[25]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[24]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[23]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[22]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[21]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[20]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[19]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[18]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[17]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[16]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[15]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[14]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[13]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[12]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[11]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[10]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[9]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[8]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[7]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[6]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[5]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[4]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[3]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[2]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[1]}]
set_load -pin_load 50 [get_ports {dmem_hwdata[0]}]
set_load -pin_load 50 [get_ports htif_pcr_req_ready]
set_load -pin_load 50 [get_ports htif_pcr_resp_valid]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[63]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[62]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[61]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[60]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[59]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[58]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[57]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[56]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[55]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[54]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[53]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[52]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[51]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[50]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[49]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[48]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[47]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[46]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[45]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[44]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[43]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[42]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[41]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[40]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[39]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[38]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[37]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[36]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[35]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[34]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[33]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[32]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[31]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[30]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[29]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[28]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[27]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[26]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[25]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[24]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[23]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[22]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[21]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[20]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[19]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[18]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[17]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[16]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[15]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[14]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[13]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[12]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[11]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[10]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[9]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[8]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[7]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[6]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[5]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[4]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[3]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[2]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[1]}]
set_load -pin_load 50 [get_ports {htif_pcr_resp_data[0]}]
set_load -pin_load 50 [get_ports htif_ipi_req_valid]
set_load -pin_load 50 [get_ports htif_ipi_req_data]
set_load -pin_load 50 [get_ports htif_ipi_resp_ready]
set_load -pin_load 50 [get_ports htif_debug_stats_pcr]
set_ideal_network -no_propagate  [get_ports clk]
create_clock -name clk  -period 5000  -waveform {0 2500}
set_input_delay -clock clk  -max 6  [get_ports clk]
set_input_delay -clock clk  -min 4  [get_ports clk]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[23]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[23]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[22]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[22]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[21]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[21]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[20]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[20]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[19]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[19]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[18]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[18]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[17]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[17]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[16]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[16]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[15]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[15]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[14]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[14]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[13]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[13]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[12]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[12]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[11]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[11]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[10]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[10]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[9]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[9]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[8]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[8]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[7]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[7]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[6]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[6]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[5]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[5]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[4]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[4]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[3]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[3]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[2]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[2]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[1]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[1]}]
set_input_delay -clock clk  -max 6  [get_ports {ext_interrupts[0]}]
set_input_delay -clock clk  -min 4  [get_ports {ext_interrupts[0]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[31]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[31]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[30]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[30]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[29]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[29]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[28]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[28]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[27]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[27]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[26]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[26]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[25]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[25]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[24]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[24]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[23]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[23]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[22]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[22]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[21]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[21]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[20]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[20]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[19]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[19]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[18]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[18]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[17]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[17]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[16]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[16]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[15]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[15]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[14]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[14]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[13]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[13]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[12]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[12]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[11]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[11]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[10]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[10]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[9]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[9]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[8]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[8]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[7]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[7]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[6]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[6]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[5]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[5]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[4]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[4]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[3]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[3]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[2]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[2]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[1]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[1]}]
set_input_delay -clock clk  -max 6  [get_ports {imem_hrdata[0]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hrdata[0]}]
set_input_delay -clock clk  -max 6  [get_ports imem_hready]
set_input_delay -clock clk  -min 4  [get_ports imem_hready]
set_input_delay -clock clk  -max 6  [get_ports {imem_hresp[0]}]
set_input_delay -clock clk  -min 4  [get_ports {imem_hresp[0]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[31]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[31]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[30]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[30]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[29]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[29]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[28]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[28]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[27]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[27]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[26]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[26]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[25]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[25]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[24]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[24]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[23]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[23]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[22]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[22]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[21]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[21]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[20]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[20]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[19]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[19]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[18]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[18]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[17]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[17]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[16]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[16]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[15]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[15]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[14]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[14]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[13]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[13]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[12]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[12]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[11]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[11]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[10]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[10]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[9]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[9]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[8]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[8]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[7]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[7]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[6]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[6]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[5]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[5]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[4]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[4]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[3]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[3]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[2]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[2]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[1]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[1]}]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hrdata[0]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hrdata[0]}]
set_input_delay -clock clk  -max 6  [get_ports dmem_hready]
set_input_delay -clock clk  -min 4  [get_ports dmem_hready]
set_input_delay -clock clk  -max 6  [get_ports {dmem_hresp[0]}]
set_input_delay -clock clk  -min 4  [get_ports {dmem_hresp[0]}]
set_input_delay -clock clk  -max 6  [get_ports htif_reset]
set_input_delay -clock clk  -min 4  [get_ports htif_reset]
set_input_delay -clock clk  -max 6  [get_ports htif_id]
set_input_delay -clock clk  -min 4  [get_ports htif_id]
set_input_delay -clock clk  -max 6  [get_ports htif_pcr_req_valid]
set_input_delay -clock clk  -min 4  [get_ports htif_pcr_req_valid]
set_input_delay -clock clk  -max 6  [get_ports htif_pcr_req_rw]
set_input_delay -clock clk  -min 4  [get_ports htif_pcr_req_rw]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[11]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[11]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[10]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[10]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[9]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[9]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[8]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[8]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[7]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[7]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[6]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[6]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[5]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[5]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[4]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[4]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[3]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[3]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[2]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[2]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[1]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[1]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_addr[0]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_addr[0]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[63]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[63]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[62]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[62]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[61]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[61]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[60]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[60]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[59]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[59]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[58]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[58]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[57]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[57]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[56]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[56]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[55]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[55]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[54]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[54]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[53]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[53]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[52]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[52]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[51]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[51]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[50]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[50]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[49]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[49]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[48]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[48]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[47]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[47]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[46]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[46]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[45]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[45]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[44]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[44]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[43]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[43]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[42]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[42]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[41]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[41]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[40]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[40]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[39]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[39]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[38]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[38]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[37]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[37]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[36]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[36]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[35]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[35]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[34]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[34]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[33]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[33]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[32]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[32]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[31]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[31]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[30]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[30]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[29]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[29]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[28]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[28]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[27]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[27]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[26]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[26]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[25]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[25]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[24]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[24]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[23]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[23]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[22]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[22]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[21]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[21]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[20]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[20]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[19]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[19]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[18]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[18]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[17]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[17]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[16]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[16]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[15]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[15]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[14]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[14]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[13]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[13]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[12]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[12]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[11]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[11]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[10]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[10]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[9]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[9]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[8]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[8]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[7]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[7]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[6]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[6]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[5]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[5]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[4]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[4]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[3]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[3]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[2]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[2]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[1]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[1]}]
set_input_delay -clock clk  -max 6  [get_ports {htif_pcr_req_data[0]}]
set_input_delay -clock clk  -min 4  [get_ports {htif_pcr_req_data[0]}]
set_input_delay -clock clk  -max 6  [get_ports htif_pcr_resp_ready]
set_input_delay -clock clk  -min 4  [get_ports htif_pcr_resp_ready]
set_input_delay -clock clk  -max 6  [get_ports htif_ipi_req_ready]
set_input_delay -clock clk  -min 4  [get_ports htif_ipi_req_ready]
set_input_delay -clock clk  -max 6  [get_ports htif_ipi_resp_valid]
set_input_delay -clock clk  -min 4  [get_ports htif_ipi_resp_valid]
set_input_delay -clock clk  -max 6  [get_ports htif_ipi_resp_data]
set_input_delay -clock clk  -min 4  [get_ports htif_ipi_resp_data]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[31]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[31]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[30]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[30]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[29]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[29]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[28]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[28]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[27]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[27]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[26]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[26]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[25]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[25]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[24]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[24]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[23]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[23]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[22]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[22]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[21]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[21]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[20]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[20]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[19]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[19]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[18]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[18]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[17]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[17]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[16]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[16]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[15]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[15]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[14]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[14]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[13]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[13]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[12]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[12]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[11]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[11]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[10]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[10]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[9]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[9]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[8]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[8]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[7]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[7]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[6]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[6]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[5]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[5]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[4]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[4]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[3]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[3]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[2]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[2]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_haddr[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_haddr[0]}]
set_output_delay -clock clk  -max 6  [get_ports imem_hwrite]
set_output_delay -clock clk  -min 4  [get_ports imem_hwrite]
set_output_delay -clock clk  -max 6  [get_ports {imem_hsize[2]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hsize[2]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hsize[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hsize[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hsize[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hsize[0]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hburst[2]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hburst[2]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hburst[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hburst[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hburst[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hburst[0]}]
set_output_delay -clock clk  -max 6  [get_ports imem_hmastlock]
set_output_delay -clock clk  -min 4  [get_ports imem_hmastlock]
set_output_delay -clock clk  -max 6  [get_ports {imem_hprot[3]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hprot[3]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hprot[2]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hprot[2]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hprot[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hprot[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hprot[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hprot[0]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_htrans[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_htrans[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_htrans[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_htrans[0]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[31]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[31]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[30]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[30]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[29]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[29]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[28]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[28]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[27]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[27]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[26]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[26]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[25]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[25]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[24]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[24]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[23]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[23]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[22]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[22]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[21]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[21]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[20]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[20]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[19]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[19]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[18]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[18]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[17]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[17]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[16]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[16]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[15]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[15]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[14]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[14]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[13]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[13]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[12]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[12]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[11]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[11]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[10]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[10]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[9]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[9]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[8]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[8]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[7]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[7]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[6]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[6]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[5]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[5]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[4]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[4]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[3]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[3]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[2]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[2]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[1]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[1]}]
set_output_delay -clock clk  -max 6  [get_ports {imem_hwdata[0]}]
set_output_delay -clock clk  -min 4  [get_ports {imem_hwdata[0]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[31]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[31]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[30]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[30]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[29]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[29]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[28]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[28]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[27]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[27]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[26]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[26]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[25]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[25]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[24]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[24]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[23]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[23]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[22]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[22]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[21]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[21]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[20]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[20]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[19]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[19]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[18]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[18]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[17]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[17]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[16]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[16]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[15]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[15]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[14]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[14]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[13]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[13]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[12]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[12]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[11]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[11]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[10]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[10]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[9]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[9]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[8]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[8]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[7]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[7]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[6]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[6]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[5]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[5]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[4]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[4]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[3]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[3]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[2]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[2]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_haddr[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_haddr[0]}]
set_output_delay -clock clk  -max 6  [get_ports dmem_hwrite]
set_output_delay -clock clk  -min 4  [get_ports dmem_hwrite]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hsize[2]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hsize[2]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hsize[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hsize[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hsize[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hsize[0]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hburst[2]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hburst[2]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hburst[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hburst[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hburst[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hburst[0]}]
set_output_delay -clock clk  -max 6  [get_ports dmem_hmastlock]
set_output_delay -clock clk  -min 4  [get_ports dmem_hmastlock]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hprot[3]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hprot[3]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hprot[2]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hprot[2]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hprot[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hprot[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hprot[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hprot[0]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_htrans[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_htrans[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_htrans[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_htrans[0]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[31]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[31]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[30]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[30]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[29]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[29]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[28]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[28]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[27]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[27]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[26]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[26]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[25]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[25]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[24]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[24]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[23]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[23]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[22]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[22]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[21]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[21]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[20]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[20]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[19]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[19]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[18]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[18]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[17]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[17]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[16]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[16]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[15]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[15]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[14]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[14]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[13]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[13]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[12]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[12]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[11]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[11]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[10]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[10]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[9]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[9]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[8]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[8]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[7]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[7]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[6]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[6]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[5]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[5]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[4]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[4]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[3]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[3]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[2]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[2]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[1]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[1]}]
set_output_delay -clock clk  -max 6  [get_ports {dmem_hwdata[0]}]
set_output_delay -clock clk  -min 4  [get_ports {dmem_hwdata[0]}]
set_output_delay -clock clk  -max 6  [get_ports htif_pcr_req_ready]
set_output_delay -clock clk  -min 4  [get_ports htif_pcr_req_ready]
set_output_delay -clock clk  -max 6  [get_ports htif_pcr_resp_valid]
set_output_delay -clock clk  -min 4  [get_ports htif_pcr_resp_valid]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[63]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[63]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[62]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[62]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[61]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[61]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[60]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[60]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[59]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[59]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[58]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[58]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[57]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[57]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[56]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[56]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[55]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[55]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[54]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[54]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[53]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[53]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[52]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[52]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[51]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[51]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[50]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[50]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[49]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[49]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[48]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[48]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[47]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[47]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[46]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[46]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[45]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[45]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[44]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[44]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[43]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[43]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[42]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[42]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[41]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[41]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[40]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[40]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[39]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[39]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[38]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[38]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[37]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[37]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[36]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[36]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[35]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[35]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[34]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[34]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[33]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[33]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[32]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[32]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[31]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[31]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[30]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[30]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[29]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[29]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[28]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[28]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[27]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[27]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[26]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[26]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[25]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[25]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[24]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[24]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[23]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[23]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[22]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[22]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[21]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[21]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[20]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[20]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[19]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[19]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[18]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[18]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[17]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[17]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[16]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[16]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[15]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[15]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[14]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[14]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[13]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[13]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[12]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[12]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[11]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[11]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[10]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[10]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[9]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[9]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[8]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[8]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[7]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[7]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[6]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[6]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[5]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[5]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[4]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[4]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[3]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[3]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[2]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[2]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[1]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[1]}]
set_output_delay -clock clk  -max 6  [get_ports {htif_pcr_resp_data[0]}]
set_output_delay -clock clk  -min 4  [get_ports {htif_pcr_resp_data[0]}]
set_output_delay -clock clk  -max 6  [get_ports htif_ipi_req_valid]
set_output_delay -clock clk  -min 4  [get_ports htif_ipi_req_valid]
set_output_delay -clock clk  -max 6  [get_ports htif_ipi_req_data]
set_output_delay -clock clk  -min 4  [get_ports htif_ipi_req_data]
set_output_delay -clock clk  -max 6  [get_ports htif_ipi_resp_ready]
set_output_delay -clock clk  -min 4  [get_ports htif_ipi_resp_ready]
set_output_delay -clock clk  -max 6  [get_ports htif_debug_stats_pcr]
set_output_delay -clock clk  -min 4  [get_ports htif_debug_stats_pcr]
