# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name vtvt_tsmc180 -timing {/home/lgy/Desktop/lab1/lab1-waitforthirty/vscale/src/main/verilog/libs/vtvt_tsmc180.lib}
create_constraint_mode -name constraint_rule -sdc_files {/home/lgy/Desktop/lab1/lab1-waitforthirty/vscale/src/main/verilog/vscale_core.sdc}
create_delay_corner -name vtvt_tsmc180 -library_set {vtvt_tsmc180}
create_analysis_view -name constraint_rule -constraint_mode {constraint_rule} -delay_corner {vtvt_tsmc180}
set_analysis_view -setup {constraint_rule} -hold {constraint_rule}
